CORESubscriber/Queries/GetChangelogStatus.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prod="http://skjema.geonorge.no/standard/geosynkronisering/1.1/produkt">
  <soapenv:Header/>
  <soapenv:Body>
    <prod:GetChangelogStatus>
      <!--Optional:-->
      <prod:changelogid>
        <prod:changelogId>?</prod:changelogId>
      </prod:changelogid>
    </prod:GetChangelogStatus>
  </soapenv:Body>
</soapenv:Envelope>