CORESubscriber/Queries/OrderChangelog.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prod="http://skjema.geonorge.no/standard/geosynkronisering/1.1/produkt">
  <soapenv:Header/>
  <soapenv:Body>
    <prod:OrderChangelog>
      <!--Optional:-->
      <prod:order service="WFS" version="?" handle="?" startIndex="0" count="1" resultType="results" outputFormat="application/gml+xml; version=3.2" resolve="none" resolveDepth="*" resolveTimeout="300">
        <prod:datasetId></prod:datasetId>
      </prod:order>
    </prod:OrderChangelog>
  </soapenv:Body>
</soapenv:Envelope>